
* 2016
** 2016-07 July
*** 2016-07-21 Thursday

**** 对配置文件作了部分修改
1. 加入 chines wubi
2. 修改主主题
3. 修改字体及字号，但报错
日期时间格式由中文变为英文？
*** DONE 2016-07-22 Friday
    CLOSED: [2016-07-22 Fri 19:10]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-22 Fri 19:10]
    :END:

**** DONE 今天送孩子到济南报到，并看了两家房子。一般且贵。
     CLOSED: [2016-07-22 Fri 17:00]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-07-22 Fri 19:13]
     CLOCK: [2016-07-22 Fri 08:30]--[2016-07-22 Fri 17:00] =>  8:30
     - State "STARTED"    from "DONE"       [2016-07-22 Fri 19:12]
     - State "DONE"       from "STARTED"    [2016-07-22 Fri 19:10]
     :END:
8：30出发，走东路不通，改走高速。12点到齐鲁交通发展集团。
5：00到泰安，累。洗车并归家。
*** 2016-07-23 Saturday

*** DONE <2016-07-23 Sat 02:44> begin today's learning and working
    CLOSED: [2016-07-23 Sat 02:46]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-23 Sat 02:46]
    :END:
*** 2016-07-26 Tuesday

*** DONE 复习英语 lesson five 96.6%
    CLOSED: [2016-07-26 Tue 11:51]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-26 Tue 11:51]
    CLOCK: [2016-07-26 Tue 11:28]--[2016-07-26 Tue 11:51] =>  0:23
    - State "STARTED"    from "WAITING"    [2016-07-26 Tue 11:28]
    - State "WAITING"    from "DONE"       [2016-07-26 Tue 09:17]
    - State "DONE"       from "STARTED"    [2016-07-26 Tue 09:17]
    CLOCK: [2016-07-26 Tue 09:16]--[2016-07-26 Tue 09:17] =>  0:01
    :END:

*** DONE vim学习<2016-07-26 Tue>
    CLOSED: [2016-07-26 Tue 09:09]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-26 Tue 09:09]
    :END:
***  清理清扫20分钟<2016-07-26 Tue>
*** DONE <2016-07-26 Tue 03:00>get up and go office begin learning
    CLOSED: [2016-07-26 Tue 04:29]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-26 Tue 04:29]
    - State "STARTED"    from "DONE"       [2016-07-26 Tue 04:28]
    - State "DONE"       from "STARTED"    [2016-07-26 Tue 04:27]
    CLOCK: [2016-07-26 Tue 03:23]--[2016-07-26 Tue 04:00] =>  0:37
    :END:
*** 2016-07-27 Wednesday

*** DONE <2016-07-27 Wed 05:00> begin learn and work
    CLOSED: [2016-07-27 Wed 06:14]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-27 Wed 06:14]
    CLOCK: [2016-07-27 Wed 05:01]--[2016-07-27 Wed 05:03] =>  0:02
    :END:
*** DONE 朗读《道德经》30节
    CLOSED: [2016-07-27 Wed 06:13]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-27 Wed 06:13]
    CLOCK: [2016-07-27 Wed 05:57]--[2016-07-27 Wed 06:13] =>  0:16
    :END:
*** DONE 到济南给孩子定房子
    CLOSED: [2016-07-27 Wed 14:25]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-27 Wed 14:25]
    CLOCK: [2016-07-27 Wed 06:14]--[2016-07-27 Wed 14:25] =>  8:11
    :END:
*** DONE begin learn and work
    CLOSED: [2016-07-28 Thu 05:24]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-28 Thu 05:24]
    CLOCK: [2016-07-28 Thu 04:02]--[2016-07-28 Thu 04:04] =>  0:02
    :END:
*** 2016-07-28 Thursday

**** DONE clean and relax
     CLOSED: [2016-07-28 Thu 06:51]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-07-28 Thu 06:51]
     CLOCK: [2016-07-28 Thu 06:13]--[2016-07-28 Thu 06:51] =>  0:38
     :END:
*** 2016-07-30 Saturday

**** DONE relax and brow
     CLOSED: [2016-07-30 Sat 07:21]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-07-30 Sat 07:21]
     CLOCK: [2016-07-30 Sat 06:03]--[2016-07-30 Sat 07:21] =>  1:18
     :END:
浏览了系列图书：有关程序、英语学习的等。

** DONE learn spacemacs
   CLOSED: [2016-07-26 Tue 16:31]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2016-07-26 Tue 16:31]
   :END:
** DONE 复制和粘贴剩余文本
   CLOSED: [2016-07-29 Fri 15:09]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2016-07-29 Fri 15:09]
   CLOCK: [2016-07-29 Fri 15:03]--[2016-07-29 Fri 15:09] =>  0:06
   :END:
map V :w^M:!ispell % ^M:e!^M^M

第二个^M使你在拼写检查完之后无须敲回车就可以到vi中.
(译注, 在我的系统里,没有ispell,只有spell,我用它替换了ispell,工作的不错;还有,
^M不是两个字符,而是一个字符,通过^V^M敲进去的;另外,我个人认为第二个^M还是不要
的好,因为直接回到vi后你就无法看到拼写检查的结果了)
 移动
** DONE 练习一遍
   CLOSED: [2016-07-22 Fri 20:43]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2016-07-22 Fri 20:43]
   CLOCK: [2016-07-22 Fri 20:25]--[2016-07-22 Fri 20:43] =>  0:18
   :END:
** DONE 学习查找替换
   CLOSED: [2016-07-23 Sat 16:59]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2016-07-23 Sat 16:59]
   CLOCK: [2016-07-23 Sat 16:45]--[2016-07-23 Sat 16:59] =>  0:14
   :END:
** DONE vim FAQ

*** 2016-07-24 Sunday

**** DONE <2016-07-24 Sun 03:47> 到达办公室开始学习工作
     CLOSED: [2016-07-27 Wed 06:13]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-07-27 Wed 06:13]
     CLOCK: [2016-07-24 Sun 03:48]--[2016-07-24 Sun 03:52] =>  0:04
     :END:
** 2016-08 August
*** 2016-08-01 Monday
**** DONE begin learning and working
     CLOSED: [2016-08-01 Mon 05:32]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-01 Mon 05:32]
     CLOCK: [2016-08-01 Mon 03:38]--[2016-08-01 Mon 03:40] =>  0:02
     :END:

**** DONE brow and lean
     CLOSED: [2016-08-01 Mon 06:01]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-01 Mon 06:01]
     CLOCK: [2016-08-01 Mon 05:35]--[2016-08-01 Mon 06:01] =>  0:26
     :END:
朗读《道德经》25节

**** DONE learn vim edit
     CLOSED: [2016-08-01 Mon 21:23]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-01 Mon 21:23]
     CLOCK: [2016-08-01 Mon 19:29]--[2016-08-01 Mon 21:23] =>  1:54
     :END:
大家來學VIM（一個歷久彌新的編輯器）
http://www.study-area.org/tips/vim/index.html
C-f page down
C-b page up

本節所述皆是在 common-mode(c-mode，在 vim 又名 normal-mode)下的移動，原始的 vi 只能在 c-mode 移動游標，在 insert-mode 只做文字的輸入，而不做游標的移動。當然 vim 及 elvis 的方向鍵是不論在那一種 mode 皆可移動自如。


基本的游標移動
h  左，或 Backspace 或方向鍵
j  下，或 Enter 或 +（要 Shift 鍵），或方向鍵
k  上，或 方向鍵或 -（不必 Shift 鍵）
l  右，或 Space 或方向鍵
使用 hjkl 鍵的移動是為了使手不必離開打字區（鍵盤中央的部位），以加快打字的速度，如果各位不習慣，那就使用方向鍵吧！
Backspace 及 Space 的移動方式是到了行首或行尾時會折行，但方向鍵或 hl 鍵的移動則在行首或行尾時您繼續按也不會折行。轉折換行的功能是 vim 的擴充功能，elvis 無此功能。
jk 及使用方向鍵的上下移動游標會盡量保持在同一欄位。使用 Enter，+，- 的上下移動，游標會移至上（下）一行的第一個非空白字元處。
好像有點複雜，各位就暫時使用方向鍵來移動就簡單明白了！等您愛上了 vim 後再來講究吧。
 Ctrl-f    即 PageDown 翻頁。
Crtl-b    即 PageUp 翻頁。


進階的游標移動
0  是數目字 0 而不是英文字母 o。或是 Hmoe 鍵，移至行首，
   （含空白字元）。
^  移至第一個非空白字元，注意，要 Shift 鍵。
$  移至行尾，或 End 鍵。要 Shift 鍵。
以上兩個按鍵是源自規則表示式（regular expression），在 regexp 中 ^ 是匹配行首，$ 是匹配行尾。
 G  移至檔尾（最後一行的第一個非空白字元處）
gg 移至檔首（第一行之第一個非空白字元處）
gg 是 vim 的擴充功能，在 elvis 或原始 vi 中可用 1G 來移至檔首（是數字 1 不是英文字 l）。
G 之原意是 goto，指移至指定數目行之行首，如不指定數目，則預設是最後一行。
 w  移至次一個字（word）字首。當然是指英文單字。
W  同上，但會忽略一些標點符號。
e  移至前一個字字尾。
E  同上，但會忽略一些標點符號。
b  移至前一個字字首。
B  同上，但會忽略一些標點符號。
H  移至螢幕頂第一個非空白字元。
M  移至螢幕中間第一個非空白字元。
L  移至螢幕底第一個非空白字元。
這和 PageDown，PageUp 不一樣，內文內容並未動，只是游標在動而已。
 n| 移至第 n 個字元(欄)處。注意，要用 Shift 鍵。n 是從頭起
   算的。
:n 移至第 n 行行首。或 nG。


特殊的移動
)  移至下一個句子（sentence）首。
(  移至上一個句子（sentence）首。
}  移至下一個段落（paragraph）首。
{  移至上一個段落（paragraph）首。
sentence 是以 . ! ? 為區格。
paragraph 是以空白行為區格。
 %  這是匹配 {}，[]，() 用的，例如您的游標現在在 { 上
   只要按 %，就會跑到相匹配的 } 上。寫程式時滿好用的。


另還有一些 vim 的特殊按鍵，但這得留待最後才來講述，否則各位恐怕會頭昏眼花了。

前單元	次單元	目　錄

*** 2016-08-02 星期二

**** DONE begin learning and working
     CLOSED: [2016-08-02 Tue 05:13]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 05:13]
     CLOCK: [2016-08-02 二 05:02]--[2016-08-02 Tue 05:13] =>  0:11

     :END:
重装spacemacs
载入出现文件目录错误，重新安装ya...解决
还有一错误ispell
用M-x install package 两遍排队错误
